Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: Note that a backslash must be inserted before every space, double quote and backslash for the ":set" command.
es_es: Tenga en cuenta que al usar la orden «:set» debe insertar una barra inversa antes de cada espacio, comilla doble y barra inversa.

source: If this confuses you, do >
es_es: Si esto le confunde, haga >

source: to check the actual resulting value.
es_es: para revisar el valor actual resultante.

source: To correct a complicated expression, use the command-line completion: >
es_es: Para corregir una expresión compleja, use el auto completa de línea de órdenes: >

source: Where <Tab> is a real Tab.
es_es: Aquí, <Tab> es una tabulación real.

source: Vim will fill in the previous value, which you can then edit.
es_es: Vim rellenará el valor previo, el cual puede después editar.

source: This is useful when you set the 'diff' option in the same window.
es_es: Es útil cuando define la opción 'diff' en la misma ventana.

source: The |vimdiff| command does this for you.
es_es: La orden |vimdiff| hace esto por usted.

source: Do this in every window that shows a different version of the same file.
es_es: Haga esto en cada ventana que muestre una versión distinta del mismo archivo.

source: You will clearly see the differences between the files, while the text that didn't change is folded.
es_es: Verá claramente las diferencias entre archivos, plegando a su vez aquellas líneas que no contienen cambios.

source: All these possibilities make you wonder which method you should choose.
es_es: Todas estas posibilidades le hacen preguntarse qué método escoger.

source: Unfortunately, there is no golden rule.
es_es: Por desgracia, no existe ninguna regla de oro.

source: Here are some hints.
es_es: Aquí tiene algunas pistas.

source: If there is a syntax file with folding for the language you are editing, that is probably the best choice.
es_es: De existir un archivo de sintaxis con plegado para el lenguaje en el que está editando, puede que sea la mejor opción.

source: If there isn't one, you might try to write it.
es_es: De no ser así, puede intentar crear uno.

source: This requires a good knowledge of search patterns.
es_es: Esto requiere un buen conocimiento de patrones de búsqueda.

source: It's not easy, but when it's working you will not have to define folds manually.
es_es: No resulta sencillo, pero una vez que funciona no tendrá definir los pliegues manualmente.

source: Typing commands to manually fold regions can be used for unstructured text.
es_es: Puede escribir órdenes para plegar manualmente ciertas regiones al tratar con un texto sin estructura.

source: Then use the |:mkview| command to save and restore your folds.
es_es: Use después la orden |:mkview| para guardar y restaurar los pliegues.

source: The marker method requires you to change the file.
es_es: El método de marcado requiere que modifique el archivo.

source: If you are sharing the files with other people or you have to meet company standards, you might not be allowed to add them.
es_es: Si comparte archivos con más personas, o tiene que cumplir con las directrices de una compañía, cabe que no se le permita añadirlos.

source: The main advantage of markers is that you can put them exactly where you want them.
es_es: La principal ventaja de los marcadores es que puede insertarlas exactamente donde desee.

source: That avoids that a few lines are missed when you cut and paste folds.
es_es: Esto evita que se pierdan algunas líneas al copiar y pegar pliegues.

source: And you can add a comment about what is contained in the fold.
es_es: Puede después añadir un comentario acerca de los contenidos del pliegue.

source: Folding by indent is something that works in many files, but not always very well.
es_es: Plegar por sangrado funciona en muchos ficheros, aunque con resultados variables.

source: Use it when you can't use one of the other methods.
es_es: Úselo cuando no puede usar ninguno de los otros métodos.

source: However, it is very useful for outlining.
es_es: Aún así, es de utilidad con los diseños preliminares.

source: Then you specifically use one 'shiftwidth' for each nesting level.
es_es: Puede entonces usar un 'shiftwidth' en particular para cada nivel de anidado.

source: Folding with expressions can make folds in almost any structured text.
es_es: Plegar con expresiones puede crear pliegues en prácticamente cualquier texto estructurado.

source: It is quite simple to specify, especially if the start and end of a fold can easily be recognized.
es_es: Es sencillo de definir, particularmente se se pueden discernir con facilidad el principio y final de un pliegue.

source: If you use the "expr" method to define folds, but they are not exactly how you want them, you could switch to the "manual" method.
es_es: Si al definir los pliegues usa el método «expr», pero no con los resultados deseados, puede pasar al método «manual».

source: This will not remove the defined folds.
es_es: Esto no elimina los pliegues ya definidos.

source: Then you can delete or add folds manually.
es_es: Puede entonces añadir o eliminar pliegues de manualmente.

source: *help.txt* For Vim version 7.3.
es_es: *help.esx* *ayuda* Para Vim versión 7.3.

source: VIM - main help file k Move around: Use the cursor keys, or "h" to go left, h l "j" to go down, "k" to go up, "l" to go right.
es_es: VIM - archivo principal de ayuda k Desplazamiento: Use las teclas de dirección, h l o «h» para ir a la izquierda, j «j» para ir hacia abajo, «k» hacia arriba y «l» a la derecha.

source: j Close this window: Use ":q<Enter>".
es_es: Cerrar esta ventana: Use «:q<Intro>».

source: Get out of Vim: Use ":qa!<Enter>" (careful, all changes are lost!).
es_es: Salir de Vim: Use «:qa!<Intro>» (¡Atención, perderá todos los cambios realizados!).

source: Get specific help: It is possible to go directly to whatever you want help on, by giving an argument to the |:help| command.
es_es: Obtener ayuda específica: Es posible acudir directamente donde necesite ayuda, introduciéndolo como un argumento de la orden |:help|.

source: It is possible to further specify the context: *help-context* WHAT PREPEND EXAMPLE ~ Normal mode command (nothing) :help x Visual mode command v_ :help v_u Insert mode command i_ :help i_<Esc> Command-line command : :help :quit Command-line editing c_ :help c_<Del> Vim command argument - :help -r Option ' :help 'textwidth' Search for help: Type ":help word", then hit CTRL-D to see matching help entries for "word".
es_es: Es posible especificar detalladamente el contexto: *help-context* QUÉ ANEXAR EJEMPLO ~ Orden modo Normal (nada) :help x Orden modo Visual v_ :help v_u Orden modo insertar i_ :help i_<Esc> Orden de línea de órdenes : :help :quit Edición de línea de órdenes c_ :help c_<Supr> Argumento de la orden VIM - :help -r Opción ' :help 'textwidth' Buscar ayuda: Teclee «:help palabra» y pulse CTRL-D para ver las entradas de ayuda coincidentes con «palabra».

source: Or use ":helpgrep word".
es_es: O use «:helpgrep palabra».

source: VIM stands for Vi IMproved.
es_es: VIM significa «Vi IMproved» (Vi mejorado).

source: Most of VIM was made by Bram Moolenaar, but only through the help of many others.
es_es: Bram Moolenaar es el principal creador de Vim, pero sólo con la ayuda de muchos otros.

source: See |credits|.
es_es: Véase |credits|.

source: REFERENCE MANUAL: These files explain every detail of Vim.
es_es: MANUAL DE REFERENCIA: Estos archivos explican cada detalle de Vim.

source: Note that tags are within | characters, but when highlighting is enabled these characters are hidden.
es_es: Tenga en cuenta que las etiquetas se encuentran entre caracteres «|», que se ocultarán si activa el resaltado.

source: That makes it easier to read a command.
es_es: Ello hace más sencillo leer una orden.

source: *usr_toc.txt* For Vim version 7.3.
es_es: *usr_toc.esx* Para Vim versión 7.3.

source: |usr_06.txt| Using syntax highlighting |06.1| Switching it on |06.2| No or wrong colors?
es_es: |usr_06.esx| Uso del resaltado de sintaxis |06.1| Activar |06.2| ¿Colores incorrectos o ausentes?

source: |06.3| Different colors |06.4| With colors or without colors |06.5| Printing with colors |06.6| Further reading
es_es: |06.3| Diferentes colores |06.4| Con colores o sin colores |06.5| Imprimir con colores |06.6| Más información

source: |usr_11.txt| Recovering from a crash |11.1| Basic recovery |11.2| Where is the swap file?
es_es: |usr_11.esx| Recuperarse de un fallo |11.1| Recuperación básica |11.2| ¿Dónde está el archivo de recuperación?

source: |usr_28.txt| Folding |28.1| What is folding?
es_es: |usr_28.txt| Plegar |28.1| ¿Qué es plegar?

source: *usr_06.txt* For Vim version 7.3.
es_es: *usr_06.esx* Para Vim version 7.3.

source: Last change: 2009 Oct 28
es_es: Último cambio: 24/5/2006

source: Black and white text is boring.
es_es: El texto en blanco y negro es aburrido.

source: With colors your file comes to life.
es_es: Con colores los archivos tienen más vida.

source: This not only looks nice, it also speeds up your work.
es_es: No sólo adquieren mejor apariencia, si no que acelera la producción.

source: Change the colors used for the different sorts of text.
es_es: Cambie los colores para distintos tipos de texto.

source: Print your text, with the colors you see on the screen.
es_es: Imprima sus textos con los colores que ve en pantalla.

source: |06.1| Switching it on |06.2| No or wrong colors?
es_es: |06.1| Activar |06.2| ¿Colores incorrectos o ausentes?

source: That should work in most situations to get color in your files.
es_es: Esto debería funcionar en la mayoría de las situaciones para obtener el coloreado.

source: Vim will automagically detect the type of file and load the right syntax highlighting.
es_es: Vim detectará automágicamente el tipo de archivo y cargará la sintaxis correspondiente.

source: Suddenly comments are blue, keywords brown and strings red.
es_es: De repente, los comentarios, las palabras clave y las cadenas se colorean.

source: This makes it easy to overview the file.
es_es: Esto facilita una vista general del archivo.

source: After a while you will find that black&white text slows you down!
es_es: ¡Tras usarlo un poco se dará cuenta de lo que le ralentizaba la edición el blanco y negro!

source: - Your terminal does not support colors.
es_es: - Su terminal no soporta colores.

source: Vim will use bold, italic and underlined text, but this doesn't look very nice.
es_es: Vim usará negrita, itálica y texto subrayado, pero esto no es muy agradable.

source: You probably will want to try to get a terminal with colors.
es_es: Probablemente quiera probar una terminal con colores.

source: For Unix, I recommend the xterm from the XFree86 project: |xfree-xterm|.
es_es: Para Unix, se recomienda usar la xterm del proyecto XFree86: |xfree-xterm|.

source: - Your terminal does support colors, but Vim doesn't know this.
es_es: - Su terminal soporta colores, pero Vim no lo sabe.

source: Make sure your $TERM setting is correct.
es_es: Asegúrese de que la variable $TERM es correcta.

source: For example, when using an xterm that supports colors: >
es_es: Por ejemplo, cuando use una xterm que soporte colores: >

source: < The terminal name must match the terminal you are using.
es_es: < El nombre de la terminal debe coincidir con la terminal que esté usando.

source: If it still doesn't work, have a look at |xterm-color|, which shows a few ways to make Vim display colors (not only for an xterm).
es_es: Si aún así no funciona, consulte |xterm-color|, donde puede ver unas cuantas maneras de hacer que se vean colores.

source: - The file type is not recognized.
es_es: - El tipo de archivo no es reconocido.

source: Vim doesn't know all file types, and sometimes it's near to impossible to tell what language a file uses.
es_es: Vim no conoce todos los tipos de archivos, y a veces es casi imposible decir que lenguaje usa un archivo.

source: Try this command: >
es_es: Pruebe esta orden: >

source: :set filetype < If the result is "filetype=" then the problem is indeed that Vim doesn't know what type of file this is.
es_es: :set filetype < Si el resultado es «filetype=» entonces el problema es que Vim no sabe que de qué tipo de archivo se trata.

source: You can set the type manually: >
es_es: Puede decirle el tipo de archivo de forma manual: >

source: < To see which types are available, look in the directory $VIMRUNTIME/syntax.
es_es: < Para ver qué tipos de archivos están disponibles, mire en el directorio «$VIMRUNTIME/syntax».

source: For the GUI you can use the Syntax menu.
es_es: Para la GUI puede usar el menú Syntax.

source: Setting the filetype can also be done with a |modeline|, so that the file will be highlighted each time you edit it.
es_es: También puede activar el tipo de archivo con un |modeline|, de forma que el archivo se resaltará cada vez que lo edite.

source: For example, this line can be used in a Makefile (put it near the start or end of the file): >
es_es: Por ejemplo, puede emplear esta línea para los Makefiles (insértela cerca del principio o el final del archivo): >

source: < You might know how to detect the file type yourself.
es_es: < Quizá sepa cómo detectar el tipo de archivo por cuenta propia.

source: Often the file name extension (after the dot) can be used.
es_es: A menudo se puede emplear la extensión del nombre de archivo.

source: See |new-filetype| for how to tell Vim to detect that file type.
es_es: Véase |new-filetype| para ver cómo decirle a Vim que detecte el tipo.

source: - There is no highlighting for your file type.
es_es: - No hay resaltado para su tipo de archivo.

source: You could try using a similar file type by manually setting it as mentioned above.
es_es: Puede intentar usar un archivo similar activándolo manualmente como se explica más arriba.

source: If that isn't good enough, you can write your own syntax file, see |mysyntaxfile|.
es_es: Si no tiene suficiente, puede escribir su propio archivo de sintaxis, consulte |mysyntaxfile|.

source: - The colored text is very hard to read.
es_es: - El texto coloreado es muy difícil de leer.

source: Vim guesses the background color that you are using.
es_es: Vim trata de averiguar el color de fondo que está usando.

source: If it is black (or another dark color) it will use light colors for text.
es_es: Si es negro (u otro color oscuro) usará colores claros para el texto.

source: If it is white (or another light color) it will use dark colors for text.
es_es: Si es blanco (u otro color claro) usará colores oscuros para el texto.

source: If Vim guessed wrong the text will be hard to read.
es_es: Si Vim no ha acertado, el texto se hará difícil de leer.

source: To solve this, set the 'background' option.
es_es: Para solucionar esto, active la opción 'background'.

source: For a dark background: >
es_es: Para un fondo oscuro: >

source: < Make sure you put this _before_ the ":syntax enable" command, otherwise the colors will already have been set.
es_es: < Asegúrese de que lo pone _antes_ de «:syntax enable», en caso contrario, los colores ya se habrán definido.

source: You could do ":syntax reset" after setting 'background' to make Vim set the default colors again.
es_es: Puede hacer «:syntax reset» tras activar 'background' para hacer que Vim vuelva a redefinir los colores.

source: If you don't like the default colors, you can select another color scheme.
es_es: Si no le gustan los colores predeterminados, puede seleccionar otro esquema de colores.

source: In the GUI use the Edit/Color Scheme menu.
es_es: En GVim, use el menú Edit/Color.

source: You can also type the command: >
es_es: También puede usar la orden: >

source: "evening" is the name of the color scheme.
es_es: «evening» es el nombre del esquema de colores.

source: There are several others you might want to try out.
es_es: Hay muchos otros que quizá quiera probar.

source: Look in the directory $VIMRUNTIME/colors.
es_es: Mire en el directorio «$MYVIMRUNTIME/colors».

source: You could also write your own color scheme.
es_es: También puede escribir su propio esquema de colores.

source: This is how you do it:
es_es: Así es que como se hace:

source: Select a color scheme that comes close.
es_es: Seleccione un esquema que se parezca.

source: Copy this file to your own Vim directory.
es_es: Copie ese archivo a su propio directorio de Vim.

source: For Unix, this should work: >
es_es: Bajo Unix, esto debería funcionar: >

source: Edit the color scheme file.
es_es: Editar el archivo del esquema de colores.

source: These entries are useful:
es_es: Estas entradas son útiles:

source: :highlight Comment ctermfg=green guifg=green < Attributes you can use for "cterm" and "gui" are "bold" and "underline".
es_es: :highlight Comment ctermfg=green guifg=green < Los atributos que puede usar para «cterm» y «gui» son «bold» y «underline».

source: If you want both, use "bold,underline".
es_es: Si quiere los dos, escriba «bold,underline».

source: For details see the |:highlight| command.
es_es: Para más detalles, consulte la orden |:highlight|.

source: Tell Vim to always use your color scheme.
es_es: Decir a Vim que use siempre su esquema.

source: Put this line in your |vimrc|: >
es_es: Incluya esto en su |vimrc|: >

source: You will see text in various color combinations.
es_es: Verá texto en varias combinaciones de colores.

source: You can check which ones are readable and look nice.
es_es: Puede comprobar cuáles son legibles y que tienen un apariencia agradable.

source: Displaying text in color takes a lot of effort.
es_es: Mostrar texto en color conlleva un gran uso del procesador.

source: If you find the displaying too slow, you might want to disable syntax highlighting for a moment: >
es_es: Si le parece que el texto se muestra muy lentamente, puede desactivar el resaltado momentáneamente: >

source: This will enable the syntax highlighting, but not switch it on automatically when starting to edit a buffer.
es_es: Esto permitirá el resaltado, pero no lo activará automáticamente cuando edites un búfer.

source: To switch highlighting on for the current buffer, set the 'syntax' option: >
es_es: Para activarla en el búfer actual, asigne la opción 'syntax' del siguiente modo: >

source: You will get the usual printer dialog, where you can select the printer and a few settings.
es_es: Le aparecerá el típico diálogo de impresora, donde puede seleccionarla junto con algunas opciones.

source: If you have a color printer, the paper output should look the same as what you see inside Vim.
es_es: Si tiene una impresora a color, la salida impresa debe ser similar a lo que aparece en pantalla.

source: But when you use a dark background the colors will be adjusted to look good on white paper.
es_es: Sin embargo, cuando tiene un fondo oscuro, los colores se ajustarán para verse bien sobre blanco.

source: "v" starts Visual mode.
es_es: «v» inicia el modo Visual.

source: "100j" moves a hundred lines down, they will be highlighted.
es_es: «100j» le mueve 100 líneas hacia abajo, que se resaltarán.

source: Then ":hardcopy" will print those lines.
es_es: Por último «:hardcopy» imprimirá las líneas destacadas.

source: You can use other commands to move in Visual mode, of course.
es_es: Puede usar otras órdenes para moverse en modo Visual, por supuesto.

source: This also works on Unix, if you have a PostScript printer.
es_es: Esto también funciona en Unix si tiene una impresora PostScript.

source: Otherwise, you will have to do a bit more work.
es_es: En caso contrario, tendrá que hacer un poco más de trabajo.

source: You need to convert the text to HTML first, and then print it from a web browser.
es_es: Tendrá que convertir a HTML primero y luego imprimirlo desde un navegador web.

source: You will see it crunching away, this can take quite a while for a large file.
es_es: Lo verá trabajar, esto puede llevar un buen tiempo para archivos grandes.

source: Some time later another window shows the HTML code.
es_es: Un rato después otra ventana muestra el código HTML.

source: Now write this somewhere (doesn't matter where, you throw it away later): > :write main.c.html
es_es: Ahora guarde esto en algún lugar (no importa dónde, lo eliminará en cuanto termine de imprimir): > :write main.c.html

source: Open this file in your favorite browser and print it from there.
es_es: Abra este archivo en su navegador favorito e imprímalo desde allí.

source: If all goes well, the output should look exactly as it does in Vim.
es_es: Si todo ha salido bien, la salida debe tener la misma apariencia que tenía en Vim.

source: See |2html.vim| for details.
es_es: Véase |2html.vim| para más detalles.

source: Don't forget to delete the HTML file when you are done with it.
es_es: No se olvide de eliminar el archivo HTML.

source: |usr_44.txt| Your own syntax highlighted.
es_es: |usr_44.txt| Su propio resaltado de sintaxis.

source: |syntax| All the details.
es_es: |syntax| Todos los detalles.

source: *usr_12.txt* For Vim version 7.3.
es_es: *usr_12.esx* Para Vim versión 7.3.

source: By combining several commands you can make Vim do nearly everything.
es_es: Puedes conseguir que Vim haga casi cualquier cosa,.mediante la combinación varias órdenes.

source: In this chapter a number of useful combinations will be presented.
es_es: En este capítulo, presentaremos una serie de combinaciones útiles.

source: This uses the commands introduced in the previous chapters and a few more.
es_es: Esto emplea las órdenes introducidos en capítulos anteriores y algunos más.

source: Obviously, this still goes wrong on "fourteen".
es_es: Obviamente, esto también funcionará mal con «cuatrocientos».

source: Use "\>" to match the end of a word: >
es_es: Use «\>» para concordar el final de una palabra: >

source: If you are programming, you might want to replace "four" in comments, but not in the code.
es_es: Si está programando, quizá desee reemplazar «cuatro» en los comentarios, pero no en el código.

source: Since this is difficult to specify, add the "c" flag to have the substitute command prompt you for each replacement: >
es_es: Ya que es difícil de especificar, añada la opción «c» para que se le pida una confirmación cada vez que se vaya a reemplazar la palabra: >

source: Suppose you want to replace a word in more than one file.
es_es: Suponga que quiere reemplazar una palabra en más de un archivo.

source: You could edit each file and type the command manually.
es_es: Puede editar cada archivo y escribir la orden manualmente.

source: It's a lot faster to use record and playback.
es_es: Es mucho más fácil usar la grabación y reproducción.

source: Let's assume you have a directory with C++ files, all ending in ".cpp".
es_es: Vamos a suponer que tiene un directorio con archivos C++ en el que todos terminan en «.cpp».

source: There is a function called "GetResp" that you want to rename to "GetAnswer".
es_es: Quiere renombrar la función «GetResp» a «GetAnswer».

source: At the last file you will get an error message, because ":wnext" cannot move to the next file.
es_es: En el último archivo obtendrá un mensaje de error, porque «wnext» no puede ir a un archivo siguiente.

source: This stops the execution, and everything is done.
es_es: Esto parará la ejecución y todo terminará.

source: Note: When playing back a recorded sequence, an error stops the execution.
es_es: Nota: Cuando vuelva a reproducir una secuencia grabada, un error detendrá la ejecución.

source: Therefore, make sure you don't get an error message when recording.
es_es: Cuide de no producir errores cuando grabes.
